# Control Flow แบ่งเป็น 2กลุ่ม / Control Statement แบ่งเป็น 2กลุ่มเช่นกัน 
# 1. Selection/Decision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น 3 แบบย่อย
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ (if)
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จก็ทำ  (if-else)
# - พิสูจน์ตรวจสอบหลายครั้ง              (if-else-else), (match-case)

# 2. Loop/Iteration/Repetition ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ
# - รู้จำนวนครั้งในการทำซ้ำ
# - ไม่รู้จำนวนครั้งในการทำซ้ำ
# - while, for
# ***สิ่งที่ต้องระวังในการทำซ้ำ คือ ต้องรู้จบ

# *** Statement ที่เกี่ยวกับ Control Flow คือคำสั่ง break, continue โดยเฉพาะ Loop