# โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุที่ผู้ใช้ป้อนมีค่าตั้งแต่ 35 ปีขึ้นไป ให้แสดงข้อความว่า "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime import datetime

print('------------------------------')
print('ตรวจสอบอายุ')
print('------------------------------')
your_name = input('ป้อนชื่อคุณ: ')
your_age = int(input('ป้อนปีเกิดคุณ:(พ.ศ.)'))
print('------------------------------')
your_age  = (datetime.now().year + 543) - your_age

if your_age >= 35:
    print(f'คุณ {your_name} อายุ {your_age} ปี แก่แล้ว...')
else:
    print(f'คุณ {your_name} อายุ {your_age} ปี ยังไม่แก่...')

print('------------------------------')