#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 
#ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? 
#น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์

print('---------------------------------')
print(' โปรแกรมตรวจสอบน้ำหนักรถบรรทุก')
print('---------------------------------')
car_plate = input('ป้อนเลขทะเบียนรถ:')
car_weigh = int(input('ป้อนน้ำหนักรถบรรทุก:'))
print('------------------------------------')
if car_weigh > 1000 :
    print(f'รถทะเบียน {car_plate} ไม่ผ่านเกณฑ์')
else :
    print(f'รถทะเบียน {car_plate} ผ่านเกณฑ์')
    
print('-----------------------------------')