# สร้างโปรแกรมคำนวณอายุของจากปีเกิด (พ.ศ.) ของพนักงานโรงงานแห่งหนึ่ง 
# โดยป้อนชื่อและปีเกิดทางแป้นพิมพ์ ทั้งนี้โปรแกรมจะหยุดทำงานก็ต่อเมมื่อป้อนชื่อพนักงาน เป็น SAU ก็จะหยุดทำงาน
from datetime import datetime

print('------------------------------')
print(' โปรแกรมคำนวณอายุของพนักงาน ')
print('------------------------------')

while True:
    emp_name = input('ป้อนชื่อพนักงาน: ')
    if emp_name == 'SAU':
        break
    emp_year = int(input('ป้อนปีเกิดพนักงาน: '))
    print('------------------------------')
    print(f'ชื่อพนักงาน {emp_name} อายุ {datetime.now().year + 543 - emp_year} ปี')
    print('------------------------------')

print('------------------')